app/controllers/movies_controller.rb

  def index
    #@movies = Movie.all
    #@movies = Movie.find(:all)
    #@movies = Movie.find(:all, :order => (params[:sort]))
    #@movies = Movie.where(:rating => @filtered_ratings)
    #@all_ratings = Movie.all_ratings
    #@movies = Movie.scoped
    session_params = session.to_hash.slice('sort', 'ratings')
    if params.slice(:sort,:ratings).empty? && session_params.any?
      flash.keep
      redirect_to movies_path(session_params)
    end

    session[:sort] = params[:sort] if params[:sort].present?
    session[:ratings] = params[:ratings] if params[:ratings].present?

    @sort_field = session[:sort]
    @ratings = session[:ratings] || Movie::RATINGS

    @all_ratings = Movie::RATINGS
    @movies = Movie.order(@sort_field).filter_by_rating(@ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date