app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @all_ratings = Movie.all_ratings
    #@movies = Movie.scoped
    @movies = Movie.order(:title) if params[:sort] == "title"
    @movies = Movie.order(:release_date) if params[:sort] == "release_date"
---
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC, "movies"."release_date" ASC